testCases/PH_2800/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       30950;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       31070;
    }
    inlet_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          65;
        startFace       31190;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet_half0;
    }
    inlet_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          65;
        startFace       31255;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet_half1;
    }
    outlet_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          65;
        startFace       31320;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet_half0;
    }
    outlet_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          65;
        startFace       31385;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet_half1;
    }
    sideRight_half0
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       31450;
    }
    sideRight_half1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       39250;
    }
    sideLeft_half0
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       47050;
    }
    sideLeft_half1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       54850;
    }
)

// ************************************************************************* //
